Revit 2027 API
RectangleLightShape Properties
The RectangleLightShape type exposes the following members.
Properties
Name | Description
EmitLength |  The emit length.
EmitWidth |  The emit width.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from LightShape)
Top
See Also
Reference
RectangleLightShape Class
Autodesk.Revit.DB.Lighting Namespace